out/thread_100/fresh/foundationdb/sqlite/no_cache/a/out_run.txt
normal
normal
normal
[...]
start running at 2024.02.21.10:30:38
start running at 2024.02.21.10:30:38
start running at 2024.02.21.10:30:38
[...]
amd64
/lib/linux/amd64/libfdb_c.so
amd64
/lib/linux/amd64/libfdb_java.so
Open normal subspace
Open normal subspace
Open normal subspace
[...]
Finish running at 2024.02.21.10:37:29
Finish running at 2024.02.21.10:38:21
Finish running at 2024.02.21.10:38:27
Finish running at 2024.02.21.10:39:15
Finish running at 2024.02.21.10:39:18
Finish running at 2024.02.21.10:39:22
Finish running at 2024.02.21.10:39:39
Finish running at 2024.02.21.10:39:39
Finish running at 2024.02.21.10:39:40
Finish running at 2024.02.21.10:39:43
Finish running at 2024.02.21.10:39:52
Finish running at 2024.02.21.10:40:04
Finish running at 2024.02.21.10:40:16
Finish running at 2024.02.21.10:40:18
Finish running at 2024.02.21.10:40:26
Finish running at 2024.02.21.10:40:26
Finish running at 2024.02.21.10:40:29
Finish running at 2024.02.21.10:40:30
Finish running at 2024.02.21.10:40:37
Finish running at 2024.02.21.10:40:40
Finish running at 2024.02.21.10:40:40
Finish running at 2024.02.21.10:40:49
Finish running at 2024.02.21.10:40:53
Finish running at 2024.02.21.10:40:54
Finish running at 2024.02.21.10:41:02
Finish running at 2024.02.21.10:41:03
Finish running at 2024.02.21.10:41:06
Finish running at 2024.02.21.10:41:06
Finish running at 2024.02.21.10:41:09
Finish running at 2024.02.21.10:41:14
Finish running at 2024.02.21.10:41:15
Finish running at 2024.02.21.10:41:16
Finish running at 2024.02.21.10:41:21
Finish running at 2024.02.21.10:41:25
Finish running at 2024.02.21.10:41:25
Finish running at 2024.02.21.10:41:25
[...]
Finish running at 2024.02.21.10:41:26
Finish running at 2024.02.21.10:41:27
Finish running at 2024.02.21.10:41:29
Finish running at 2024.02.21.10:41:33
Finish running at 2024.02.21.10:41:35
Finish running at 2024.02.21.10:41:38
Finish running at 2024.02.21.10:41:38
Finish running at 2024.02.21.10:41:39
Finish running at 2024.02.21.10:41:40
Finish running at 2024.02.21.10:41:40
Finish running at 2024.02.21.10:41:40
Finish running at 2024.02.21.10:41:43
Finish running at 2024.02.21.10:41:47
Finish running at 2024.02.21.10:41:47
Finish running at 2024.02.21.10:41:48
Finish running at 2024.02.21.10:41:48
Finish running at 2024.02.21.10:41:48
[...]
Finish running at 2024.02.21.10:41:49
Finish running at 2024.02.21.10:41:50
Finish running at 2024.02.21.10:41:50
Finish running at 2024.02.21.10:41:50
[...]
Finish running at 2024.02.21.10:41:52
Finish running at 2024.02.21.10:41:52
Finish running at 2024.02.21.10:41:54
Finish running at 2024.02.21.10:41:57
Finish running at 2024.02.21.10:41:58
Finish running at 2024.02.21.10:41:58
Finish running at 2024.02.21.10:41:59
Finish running at 2024.02.21.10:41:59
Finish running at 2024.02.21.10:42:00
Finish running at 2024.02.21.10:42:00
Finish running at 2024.02.21.10:42:01
Finish running at 2024.02.21.10:42:01
Finish running at 2024.02.21.10:42:01
Finish running at 2024.02.21.10:42:02
Finish running at 2024.02.21.10:42:03
Finish running at 2024.02.21.10:42:04
Finish running at 2024.02.21.10:42:08
Finish running at 2024.02.21.10:42:08
Finish running at 2024.02.21.10:42:08
Finish running at 2024.02.21.10:42:11
Finish running at 2024.02.21.10:42:11
Finish running at 2024.02.21.10:42:11
[...]
Finish running at 2024.02.21.10:42:12
Finish running at 2024.02.21.10:42:13
Finish running at 2024.02.21.10:42:14
Finish running at 2024.02.21.10:42:17
Finish running at 2024.02.21.10:42:17
Finish running at 2024.02.21.10:42:18
Finish running at 2024.02.21.10:42:20
Finish running at 2024.02.21.10:42:21
Finish running at 2024.02.21.10:42:22
Finish running at 2024.02.21.10:42:22
Finish running at 2024.02.21.10:42:24
Finish running at 2024.02.21.10:42:24
Finish running at 2024.02.21.10:42:26
Finish running at 2024.02.21.10:42:29
Finish running at 2024.02.21.10:42:35
Finish running at 2024.02.21.10:42:35
Finish running at 2024.02.21.10:42:37
[OVERALL], RunTime(ms), 719645
[OVERALL], Throughput(ops/sec), 833.7444156493826
[TOTAL_GCS_PS_Scavenge], Count, 339
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 2548
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.35406346184577114
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 339
[TOTAL_GC_TIME], Time(ms), 2548
[TOTAL_GC_TIME_%], Time(%), 0.35406346184577114
[READ], Operations, 299595
[READ], AverageLatency(us), 4732.00909895025
[READ], MinLatency(us), 1095
[READ], MaxLatency(us), 2660351
[READ], 95thPercentileLatency(us), 7311
[READ], 99thPercentileLatency(us), 18239
[READ], Return=OK, 299595
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 101027.75
[CLEANUP], MinLatency(us), 825
[CLEANUP], MaxLatency(us), 201727
[CLEANUP], 95thPercentileLatency(us), 197503
[CLEANUP], 99thPercentileLatency(us), 201599
[UPDATE], Operations, 300405
[UPDATE], AverageLatency(us), 210247.46561475343
[UPDATE], MinLatency(us), 5948
[UPDATE], MaxLatency(us), 86769663
[UPDATE], 95thPercentileLatency(us), 444671
[UPDATE], 99thPercentileLatency(us), 3850239
[UPDATE], Return=OK, 300405